Repository: oe-alliance/OAWeather
Catalog: po/*.po
Languages: el

source: %d Minutes
el: %d λεπτά

source: Add
el: Προσθήκη

source: Cache data
el: Δεδομένα προσωρινής αποθήκευσης

source: Celsius
el: Κελσίου

source: Choose the icon set. You need to create an additional set here: /usr/share/enigma2/WeatherIconSets/NAME.
el: Επιλέξτε το πακέτο εικονιδίων. Πρέπει να δημιουργήσετε ένα πρόσθετο πακέτο εδώ: /usr/share/enigma2/WeatherIconSets/NAME.

source: Choose whether the 'night switch' should be activated or not. Some icons are then displayed as night icons with moon.
el: Επιλέξτε αν θα πρέπει να ενεργοποιηθεί ή όχι ο "νυχτερινός διακόπτης". Ορισμένα εικονίδια εμφανίζονται τότε ως εικονίδια νύχτας με φεγγάρι.

source: Show trend arrows for moon data
el: Εμφάνιση βελών τάσης για δεδομένα σελήνης

source: Show trend arrows for moon illumination and moon distance to see the current trend of the data.
el: Εμφάνιση βελών τάσης για τη λαμπρότητα και την απόσταση της σελήνης για προβολή της τρέχουσας τάσης δεδομένων.

source: Chose favorite
el: Επιλογή αγαπημένου

source: City '%s' not found! Please try another wording.
el: Η πόλη %s δεν βρέθηκε! Παρακαλώ δοκιμάστε διαφορετική διατύπωση.

source: Current Weather
el: Τρέχων καιρός

source: Default
el: Προεπιλογή

source: Defaults
el: Προεπιλογές

source: Delete
el: Διαγραφή

source: Disabled
el: Ανενεργό

source: Do you really want do delete favorite '%s'?
el: Θέλετε πραγματικά να διαγράψετε το αγαπημένο '%s';

source: Do you really want do exit without saving your modified favorite list?
el: Θέλετε πραγματικά να γίνει έξοδος χωρίς να αποθηκευτεί η τροποποιημένη λίστα αγαπημένων;

source: East
el: Ανατολικά

source: Edit
el: Επεξεργασία

source: Enable Debug
el: Ενεργοποίηση αποσφαλμάτωσης

source: Enabled
el: Ενεργό

source: Enter the location for your weather forecasts. To include your location, expand your favorites list with 'Manage your favorites'.
el: Εισαγωγή τοποθεσίας καιρού αγαπημένων. Για να συμπεριλάβετε την τοποθεσία σας, επεκτείνετε τη λίστα αγαπημένων μέσω της διαχείρισης.

source: Error getting City ID
el: Σφάλμα εύρεσης αναγνωριστικού πόλης

source: Error in Weatherinfo
el: Σφάλμα πληροφοριών καιρού

source: More Details / Smaller font
el: Περισσότερες / Μικρότερη γραμματοσειρά

source: Less details / Larger font
el: Λιγότερες / Μεγαλύτερη γραμματοσειρά

source: Fahrenheit
el: Φαρενάιτ

source: Favorites have been successfully saved!
el: Τα αγαπημένα αποθηκεύτηκαν με επιτυχία!

source: Feels like
el: Αίσθηση

source: Humidity
el: Υγρασία

source: MSN weather
el: Καιρός MSN

source: Manage favorites
el: Διαχείριση αγαπημένων

source: Metric unit for wind speed
el: Μετρική μονάδα για την ταχύτητα ανέμου

source: Next favorite
el: Επόμενο αγαπημένο

source: View details
el: Εμφάνιση λεπτομερειών

source: Day +/-
el: Ημέρα +/-

source: Details +/-
el: Πληροφορίες +/-

source: Settings
el: Ρυθμίσεις

source: Glass
el: Γυαλί

source: Manage your favorites
el: Διαχείριση αγαπημένων

source: No data available for this period.
el: Μη διαθέσιμα δεδομένα για αυτή την περίοδο.

source: No data available.
el: Μη διαθέσιμα δεδομένα.

source: North
el: Βόρεια

source: Northeast
el: Βορειοανατολικά

source: Northwest
el: Βορειοδυτικά

source: Open-Meteo Wetter
el: Καιρός Open-Meteo

source: Precipitation
el: Υετός

source: Previous favorite
el: Προηγούμενο αγαπημένο

source: Refresh interval
el: Διάστημα ανανέωσης

source: Save
el: Αποθήκευση

source: Search for your city
el: Αναζήτηση για την πόλη σας

source: Select 'Yes' to enable add debug output to log.
el: Επιλέξτε «ναι» για να ενεργοποιηθεί η προσθήκη της αποσφαλμάτωσης στο αρχείο καταγραφής.

source: Select 'Yes' to enable the addition of Weather.
el: Επιλέξτε «ναι» για να ενεργοποιηθεί η προσθήκη του πρόσθετου.

source: Select desired location
el: Επιλογή επιθυμητής τοποθεσίας

source: Select the metric unit for wind speed to be used for wind displays. This has no effect on the imperial unit 'mph'.
el: Επιλογή της μετρικής μονάδας για την ταχύτητα του ανέμου προς χρήση σε απεικόνιση. Αυτό δεν επηρεάζει την αυτοκρατορική μονάδα 'mph'.

source: Select the preferred weather service to supply the weather information.
el: Επιλογή της προτιμώμενης υπηρεσίας παροχής των πληροφοριών καιρού.

source: Select the temperature unit to be used for temperature displays.
el: Επιλογή μονάδας θερμοκρασίας για χρήση στις ενδείξεις θερμοκρασίας.

source: Detail level in detail view
el: Επίπεδο λεπτομερειών

source: Select the detail level in the detail view. You have the choice between a comprehensive presentation in a smaller font and a reduced presentation with a larger font.
el: Επιλέξτε το επίπεδο λεπτομερειών στην προβολή λεπτομερειών. Έχετε την επιλογή μεταξύ μίας αναλυτικότερης παρουσίασης με μικρότερη γραμματοσειρά και μίας συντομότερης με μεγαλύτερη γραμματοσειρά.

source: Select this option to save that last obtained weather data locally. This is used to initialize the data immediately after restart while updated data is being fetched.
el: Ενεργοποιήστε αυτήν την επιλογή για να αποθηκευτούν τα τελευταία δεδομένα καιρού που λήφθηκαν τοπικά. Αυτό χρησιμοποιείται για την προετοιμασία των δεδομένων αμέσως μετά την επανεκκίνηση, ενώ γίνεται λήψη ενημερωμένων δεδομένων.

source: Select your location
el: Επιλογή της τοποθεσίας σας

source: Set default values
el: Ορισμός προεπιλεγμένων τιμών

source: Show Weather Forecast
el: Εμφάνιση πρόγνωσης καιρού

source: South
el: Νότια

source: Southeast
el: Νοτιοανατολικά

source: Southwest
el: Νοτιοδυτικά

source: Specify how often Weather retrieves its data from the server. 'Once' means the data will loaded only once after a GUI or system start.
el: Καθορίστε πόσο συχνά το πρόσθετο θα ανακτά τα δεδομένα του από το διακομιστή. «Μία φορά» σημαίνει ότι τα δεδομένα θα φορτωθούν μόνο μία φορά μετά την εκκίνηση της επιφάνειας χρήστη ή του συστήματος.

source: Temperature unit
el: Μονάδα θερμοκρασίας

source: The city name is too short. More than 2 characters are needed for search.
el: Το όνομα της πόλης είναι πολύ μικρό. Απαιτούνται περισσότεροι από 2 χαρακτήρες για την αναζήτηση.

source: The favorite '%s' corresponds to the set weather city name and therefore cannot be deleted.
el: Το αγαπημένο '%s' αντιστοιχεί στην ήδη ορισμένη πόλη καιρού και έτσι δεν γίνεται να διαγραφεί.

source: Today
el: Σήμερα

source: Update
el: Ενημέρωση

source: Weather Plugin
el: Πρόσθετο καιρού

source: Weather Plugin Detailview
el: Πρόσθετο καιρού λεπτομέρειες

source: Weather Plugin Overview
el: Πρόσθετο καιρού επισκόπηση

source: Weather Settings Actions
el: Ενέργειες ρυθμίσεων καιρού

source: Weather city name
el: Όνομα πόλης καιρού

source: Weather cityname (at least 3 letters):
el: Όνομα πόλης καιρού (τουλάχιστον 3 γράμματα):

source: Weather icon night switch
el: Διακόπτης νύχτας εικονιδίου καιρού

source: Weather icon set
el: Πακέτο εικονιδίων

source: Weather service
el: Υπηρεσία καιρού

source: Weather API key v2.5
el: Κλειδί API για τον καιρό v2.5

source: Weather settings
el: Ρυθμίσεις καιρού

source: West
el: Δυτικά

source: km/h
el: χλμ/ω

source: m/s
el: μ/δ

source: n/a
el: μ/δ

source: ↓ N
el: ↓ Β

source: ↙ NE
el: ↙ ΒΑ

source: ← E
el: ← Α

source: ↖ SE
el: ↖ ΝΑ

source: ↑ S
el: ↑ Ν

source: → W
el: → Δ

source: ↘ NW
el: ↘ ΒΔ
